load-test.yml
config:
  target: "http://54.201.165.116"
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 5
    - name: "Ramp up"
      duration: 60
      arrivalRate: 5
      rampTo: 30
    - name: "Sustained load"
      duration: 60
      arrivalRate: 30
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Browse feed (unauthenticated)"
    weight: 2
    flow:
      - get:
          url: "/"

  - name: "Register and post"
    weight: 1
    flow:
      - post:
          url: "/api/auth/register"
          json:
            email: "loadtest-{{ $randomString() }}@example.com"
            password: "Password123!"
          capture:
            - json: "$.data.user.id"
              as: "userId"
      - post:
          url: "/api/posts"
          formData:
            text_content: "Load test post {{ $randomString() }}"
      - get:
          url: "/api/posts"